app/Http/Controllers/AdminController.php

select * from `job_applications` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `job_applications`
---
    public function jobApplications()
{
    // Load all job applications with related job info, ordered latest first
    $applications = \App\Models\JobApplication::with('job')->latest()->paginate(20);