app/Http/Controllers/JobApplicationController.php

insert into `job_applications` (`job_id`, `user_id`, `name`, `email`, `cover_letter`, `resume_path`, `updated_at`, `created_at`) values ('27', 10, 'jessa dragon', 'romeovillamor@gmail.com', 'asdas', 'resumes/dSq8ukp7Gbb3lJk3tqUfJxBllmvIR7ISJ0iDViEO.pdf', '2025-07-25 07:50:47', '2025-07-25 07:50:47')
---
public function store(Request $request, $jobId)
{
    $request->validate([
        'name' => 'required|string|max:255',
        'email' => 'required|email|max:255',
        'cover_letter' => 'nullable|string',
        'resume' => 'required|file|mimes:pdf,doc,docx|max:2048',
    ]);

    $application = new JobApplication();
    $application->job_id = $jobId;
    $application->user_id = auth()->id();  // <== ADD THIS LINE
    $application->name = $request->name;
    $application->email = $request->email;
    $application->cover_letter = $request->cover_letter;

    if ($request->hasFile('resume')) {
        $application->resume_path = $request->file('resume')->store('resumes', 'public');
    }

    $application->save();

select * from `job_applications` where `user_id` = 10 order by `created_at` desc
---
    public function myApplications()
    {
        $applications = JobApplication::with('job')
            ->where('user_id', auth()->id())
            ->latest()
            ->get();