app/Http/Controllers/UserController.php

select * from `job_applications` where `job_applications`.`user_id` = 10 and `job_applications`.`user_id` is not null order by `created_at` desc
---
public function dashboard()
{
    $user = auth()->user();

    // Make sure User model has applications() relationship
    $applications = $user->applications()->with('job')->latest()->get();